#ifndef __USART_H
#define __USART_H
#include "stdio.h"	
#include "stm32f4xx_conf.h"
#include "sys.h" 
//////////////////////////////////////////////////////////////////////////////////	 
//±Ÿ³ÌÐòÖ»¹©Ñ§Ï°Ê¹ÓÃ£¬ÎŽŸ­×÷ÕßÐí¿É£¬²»µÃÓÃÓÚÆäËüÈÎºÎÓÃÍŸ
//Mini STM32¿ª·¢°å
//Ž®¿Ú1³õÊŒ»¯		   
//ÕýµãÔ­×Ó@ALIENTEK
//ŒŒÊõÂÛÌ³:www.openedv.csom
//ÐÞžÄÈÕÆÚ:2011/6/14
//°æ±Ÿ£ºV1.4
//°æÈšËùÓÐ£¬µÁ°æ±ØŸ¿¡£
//Copyright(C) ÕýµãÔ­×Ó 2009-2019
//All rights reserved
//********************************************************************************
//V1.3ÐÞžÄËµÃ÷ 
//Ö§³ÖÊÊÓŠ²»Í¬ÆµÂÊÏÂµÄŽ®¿Ú²šÌØÂÊÉèÖÃ.
//ŒÓÈëÁË¶ÔprintfµÄÖ§³Ö
//ÔöŒÓÁËŽ®¿ÚœÓÊÕÃüÁî¹ŠÄÜ.
//ÐÞÕýÁËprintfµÚÒ»žö×Ö·û¶ªÊ§µÄbug
//V1.4ÐÞžÄËµÃ÷
//1,ÐÞžÄŽ®¿Ú³õÊŒ»¯IOµÄbug
//2,ÐÞžÄÁËUSART_RX_STA,Ê¹µÃŽ®¿Ú×îŽóœÓÊÕ×ÖœÚÊýÎª2µÄ14ŽÎ·œ
//3,ÔöŒÓÁËUSART_REC_LEN,ÓÃÓÚ¶šÒåŽ®¿Ú×îŽóÔÊÐíœÓÊÕµÄ×ÖœÚÊý(²»ŽóÓÚ2µÄ14ŽÎ·œ)
//4,ÐÞžÄÁËEN_USART1_RXµÄÊ¹ÄÜ·œÊœ
////////////////////////////////////////////////////////////////////////////////// 	
#define USART_REC_LEN  			200  	//¶šÒå×îŽóœÓÊÕ×ÖœÚÊý 200
#define EN_USART1_RX 			1		//Ê¹ÄÜ£š1£©/œûÖ¹£š0£©Ž®¿Ú1œÓÊÕ
	  	
extern u8  USART_RX_BUF[USART_REC_LEN]; //œÓÊÕ»º³å,×îŽóUSART_REC_LENžö×ÖœÚ.Ä©×ÖœÚÎª»»ÐÐ·û 
extern u16 USART_RX_STA;         		//œÓÊÕ×ŽÌ¬±êŒÇ	
//Èç¹ûÏëŽ®¿ÚÖÐ¶ÏœÓÊÕ£¬Çë²»Òª×¢ÊÍÒÔÏÂºê¶šÒå
void uart_init(u32 bound);
#endif

